Repository: MichaelTimbert/zonemaster-backend
Catalog: share/*.po
Languages: da, es, fi, fr, nb, sl, sv

source: Invalid method parameter(s).
da: Invalid metodeparametre
es: Parámetro(s) de método inválido.
fi: Virheelliset asetukset
fr: Paramètres incorrects
nb: Ugyldig metodeparameter.
sl: Nepravilni parametri.
sv: Ogiltig metodparameter.

source: Missing property
da: Manglende egenskab
es: Propiedad no incluída
fi: Kenttä puuttuu
fr: Champ manquant
nb: Mangler verdi
sl: Manjkajoče polje
sv: Värde saknas

source: Warning: Zonemaster::LDNS not compiled with IDN support, cannot handle non-ASCII names correctly.
da: Advarsel: Zonemaster::LDNS ikke kompileret med IDN-support, og kan derfor ikke håndtere ikke-ascii-navne korrekt
es: Advertencia: Zonemaster::LDNS no fue compilado con soporte IDN, no se puede manejar correctamente los nombres no-ASCII.
fi: Varoitus: Zonemaster::LDNS ei ole käännetty IDN tuella, joten se ei pysty käsittelemään ei-ASCII-nimiä oikein.
fr: Attention : Zonemaster::LDNS n'est pas compilé avec le support IDN, impossible de traiter correctement les noms non ASCII.
nb: Advarsel: Zonemaster::LDNS er ikke kompilert med IDN-støtte. Kan bare håndtere ASCII-navn.
sl: Opozorilo: Zonemaster::LDNS ne podpira IDN, ni mogoče obdelati ne-ASCII imena.

source: An error occured and Zonemaster could not start or finish the test.
da: Der opstod en fejl, og Zonemaster kunne ikke starte eller afslutte testen.
es: Ha ocurrido un error y Zonemaster no pudo comenzar o finalizar la prueba.
fi: Tapahtui virhe, eikä Zonemaster voinut aloittaa tai suorittaa testiä loppuun.
fr: Une erreur est survenue et Zonemaster n’a pas pu commencer ou finir le test.
nb: Det oppstod en feil og Zonemaster kunne ikke starte eller fullføre testen.
sl: Zgodila se je napaka, Zonemaster ne more začeti ali končati testa.

source: The test took too long to run (the current limit is {max_execution_time} seconds). Maybe there are too many name servers or the name servers are either unreachable or not responsive enough.
da: Testen tog for lang tid at afvikle (den aktuelle grænse er {max_execution_time} sekunder). Måske er der for mange navneservere, eller også er navneserverne enten ikke tilgængelige eller ikke responsive nok.
es: La prueba tomó demasiado tiempo en terminar (el límite máximo actual es {max_execution_time} segundos). Quizás hay demasiados servidores de nombres, o son inalcanzables, o no lo suficientemente rápidos para responder.
fi: Testin suorittaminen kesti liian kauan (nykyinen raja on {max_execution_time} sekuntia). Ehkä nimipalvelimia on liian monta, nimipalvelimiin ei saada yhteyttä, tai ne eivät vastaa tarpeeksi nopeasti.
fr: Le test a mis trop de temps à s’exécuter (la limite actuelle est de {max_execution_time} secondes). Il y a peut-être trop de serveurs de noms, ou les serveurs de noms sont injoignables ou trop peu réactifs.
nb: Testen tok for lang tid å kjøre (gjeldende grense er {max_execution_time} sekunder). Kanskje er det for mange navnetjenere eller navnetjenerne er enten utilgjengelige eller ikke responsive nok.
sl: Test traja predolgo (trenutna meja je {max_execution_time} sekund). Mogoče je preveč strežnikov za preveriti, ali so neodzivni ali pa počasni.

source: Invalid digest format
es: Formato de resumen (digest) inválido
fi: Virheellinen tiivisteen muoto
fr: Format de l'empreinte invalide
nb: Ugyldig format på digest
sl: Nepravilen digest format
sv: Ogiltigt format på DS-digest

source: Algorithm must be a positive integer
da: Algoritmen skal være et positivt heltal
es: El algoritmo debe ser un entero positivo
fi: Algoritmin on oltava positiivinen kokonaisluku
fr: L'algorithme doit être un entier positif
nb: Algoritme må være et positivt tall
sl: Algoritem mora biti pozitivno število
sv: Algoritm måste vara ett positivt heltal

source: Digest type must be a positive integer
da: Digest type skal være et positivt heltal
es: El tipo de resumen (digest) debe ser un entero positivo
fi: Tiivistetyypin (Digest type) on oltava positiivinen kokonaisluku
fr: Le type d'empreinte doit être un entier positif
nb: Algoritme-type må være et positivt tall
sl: Tip izvlečka za DS mora biti pozitivno število
sv: Digest-typ måste vara ett positivt heltal

source: Keytag must be a positive integer
da: Keytag skal være et positivt heltal
es: El tag de llave debe ser un entero positivo
fi: Tunnisteen (Keytag) on oltava positiivinen kokonaisluku
fr: L'identifiant de clef doit être un entier positif
nb: Keytag må være et positivt tall
sl: Oznaka za ključ mora biti pozitivno število
sv: Keytag måste vara ett positivt heltal

source: Domain name required
da: Domænenavn påkrævet
es: Se necesita el nombre de dominio
fi: Vaaditaan verkkotunnus
fr: Nom de domaine requis
nb: Domenenavn påkrevd
sl: Domena je obvezna
sv: Domännamn är obligatoriskt

source: The domain name is IDNA invalid
da: Domænenavnet er IDNA ugyldigt
es: El nombre de dominio es inválido según IDNA
fi: Verkkotunnus on IDNA virheellinen
fr: Le nom de domaine n'est pas un domaine IDNA valide
nb: Domenenavnet er ikke korrekt IDNA

source: The domain name contains non-ascii characters and IDNA support is not installed
da: Domænenavnet indeholder ikke-ascii-tegn og IDNA-support er ikke installeret
es: El nombre de dominio contiene caracteres no-ascii, y el soporte IDNA no está instalado
fi: Verkkotunnuksen nimi sisältää muita kuin ascii-merkkejä, eikä IDNA tukea ole asennettu
fr: Le nom de domaine contient des caractères non ASCII et le support d'IDNA n'est pas installé
nb: Domenenavnet inneholder tegn som ikke er ascii og IDNA-støtte er ikke installert

source: The domain name character(s) are not supported
da: Domænenavnets tegn er ikke understøttet
es: Los caracteres del nombre de dominio no están soportados
fi: Verkkotunnuksen sisältämiä merkkejä ei tueta
fr: Les caractères du nom de domaine ne sont pas supportés
nb: Tegn i domenenavn er ikke supportert
sv: Domännamnstecken stöds inte

source: The domain name contains consecutive dots
da: Domænenavnet indeholder flere dots (.) efter hinanden
es: El nombre de dominio contiene puntos consecutivos
fi: Verkkotunnus sisältää peräkkäisiä pisteitä
fr: Le nom de domaine contient plusieurs points consécutifs
nb: Domenenavnet inneholder flere punkter på rad

source: The domain name or label is too long
da: Domænenavnet eller labelen er for lang
es: El nombre de dominio o la etiqueta es muy larga
fi: Verkkotunnus tai sen tunnisteet ovat liian pitkiä
fr: Le nom de domaine ou les labels sont trop longs
nb: Domenenavn eller label er for lang
sv: Domännamnet eller en domännamnsdel är för långt

source: Invalid language tag format
da: Invalidt sprogkode-format
es: Formato de descriptor de idioma inválido
fi: Virheellinen kielitunnisteen muoto
fr: Format de l'étiquette d'identification de langue incorrect
nb: Ugyldig format på språk-tag
sl: Nepravilen format zastavice za jezik
sv: Ogiltigt format på språkkoden

source: Unkown language string
da: Ukendt sprogstreng
es: Descriptor de idioma desconocido
fi: Tuntematon kielitunniste
fr: Étiquette d'identification de langue inconnue
nb: Ukjent språk-tag
sl: Neznan jezik
sv: Okänd språksträng

source: Language string not unique
fr: Étiquette d'identification de langue non unique
sv: Språksträngen är inte unik

source: Invalid IP address
da: Invalid IP-adresse
es: Dirección IP inválida
fi: Virheellinen IP-osoite
fr: Adresse IP invalide
nb: Ugylding IP-adresse
sl: Neveljaven IP naslov
sv: Ogiltig IP-adress

source: Invalid profile format
da: Invalidt profil-format
es: Formato de perfil (profile) inválido
fi: Virheellinen profiilin muoto
fr: Format de profil invalide
nb: Ugyldig format på profil
sl: Neveljaven format profila

source: Unknown profile
da: Ukendt profil
es: Perfil desconocido
fi: Tuntematon profiili
fr: Profil inconnu
nb: Ukjent profil
sl: Neznan profil
sv: Okänd profil
